Autodesk.Revit.UI.Events.ViewActivatingEventArgs.CurrentActiveView
The view that is currently active.
Remarks:
May be null if there is no currently active view.
Since:
2010

Autodesk.Revit.UI.Events.ViewActivatingEventArgs.NewActiveView
The view that is going to become active.
Since:
2010

Autodesk.Revit.UI.Events.ViewActivatingEventArgs
The event arguments used by the ViewActivating event.
Since:
2010